Revit 2027 API
DividedSurface.GetAllIntersectionElements Method
 Gets all intersection elements which produce division lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAllIntersectionElements()
Public Function GetAllIntersectionElements As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAllIntersectionElements()
member GetAllIntersectionElements : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The intersection elements.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace